<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;6&#31456; &#24615;&#33021;&#21521;&#19978;&#12395;&#38306;&#12377;&#12427;&#25216;&#27861;</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.1"><link rel="home" href="index.html" title="PostGIS 1.5.1 &#12510;&#12491;&#12517;&#12450;&#12523; &#26085;&#26412;&#35486;&#35379;"><link rel="up" href="index.html" title="PostGIS 1.5.1 &#12510;&#12491;&#12517;&#12450;&#12523; &#26085;&#26412;&#35486;&#35379;"><link rel="prev" href="ch05.html" title="&#31532;5&#31456; PostGIS&#12434;&#20351;&#12358;: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#27083;&#31689;&#12377;&#12427;"><link rel="next" href="reference.html" title="&#31532;7&#31456; PostGIS&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;6&#31456; 
  &#24615;&#33021;&#21521;&#19978;&#12395;&#38306;&#12377;&#12427;&#25216;&#27861;
  
  </th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="reference.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;6&#31456; &#24615;&#33021;&#21521;&#19978;&#12395;&#38306;&#12377;&#12427;&#25216;&#27861;"><div class="titlepage"><div><div><h2 class="title"><a name="id286826651"></a>&#31532;6&#31456; 
  &#24615;&#33021;&#21521;&#19978;&#12395;&#38306;&#12377;&#12427;&#25216;&#27861;
  
  </h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="ch06.html#id286826659">6.1. 
	&#22823;&#12365;&#12394;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#25345;&#12388;&#23567;&#12373;&#12394;&#12486;&#12540;&#12502;&#12523; 
	
	</a></span></dt><dd><dl><dt><span class="sect2"><a href="ch06.html#id286827078">6.1.1. 
	  &#21839;&#38988;&#12398;&#35500;&#26126;
	  
	  </a></span></dt><dt><span class="sect2"><a href="ch06.html#id286827108">6.1.2. 
	  &#24540;&#24613;&#20966;&#32622;
	  
	  </a></span></dt></dl></dd><dt><span class="sect1"><a href="ch06.html#id286827563">6.2. 
	&#12472;&#12458;&#12513;&#12488;&#12522;&#12452;&#12531;&#12487;&#12463;&#12473;&#12391;CLUSTER&#12434;&#23455;&#34892;&#12377;&#12427;
	
	</a></span></dt><dt><span class="sect1"><a href="ch06.html#id286827606">6.3. 
	&#27425;&#20803;&#22793;&#25563;&#12398;&#22238;&#36991;
	
	</a></span></dt><dt><span class="sect1"><a href="ch06.html#id286826987">6.4. 
	&#12467;&#12531;&#12501;&#12451;&#12462;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12398;&#12481;&#12517;&#12540;&#12531;
	
	</a></span></dt><dd><dl><dt><span class="sect2"><a href="ch06.html#id286827010">6.4.1. 
		&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;
		
		</a></span></dt><dt><span class="sect2"><a href="ch06.html#id286827877">6.4.2. &#23455;&#34892;&#26178;</a></span></dt></dl></dd></dl></div><div class="sect1" title="6.1. &#22823;&#12365;&#12394;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#25345;&#12388;&#23567;&#12373;&#12394;&#12486;&#12540;&#12502;&#12523;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="id286826659"></a>6.1. 
	&#22823;&#12365;&#12394;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#25345;&#12388;&#23567;&#12373;&#12394;&#12486;&#12540;&#12502;&#12523; 
	
	</h2></div></div></div><div class="toc"><dl><dt><span class="sect2"><a href="ch06.html#id286827078">6.1.1. 
	  &#21839;&#38988;&#12398;&#35500;&#26126;
	  
	  </a></span></dt><dt><span class="sect2"><a href="ch06.html#id286827108">6.1.2. 
	  &#24540;&#24613;&#20966;&#32622;
	  
	  </a></span></dt></dl></div><div class="sect2" title="6.1.1. &#21839;&#38988;&#12398;&#35500;&#26126;"><div class="titlepage"><div><div><h3 class="title"><a name="id286827078"></a>6.1.1. 
	  &#21839;&#38988;&#12398;&#35500;&#26126;
	  
	  </h3></div></div></div><p>
	  &#29694;&#29256;&#12398;PostgreSQL(8.0&#12434;&#21547;&#12416;)&#12391;&#12399;&#65292;TOAST&#12486;&#12540;&#12502;&#12523;&#12395;&#24467;&#12358;&#12463;&#12456;&#12522;&#12458;&#12503;&#12486;&#12451;&#12510;&#12452;&#12470;&#12398;&#24369;&#12373;&#12395;&#33510;&#12375;&#12415;&#12414;&#12377;&#65294; TOAST&#12486;&#12540;&#12502;&#12523;&#12399;&#65292;(&#38263;&#12356;&#12486;&#12461;&#12473;&#12488;&#65292;&#12452;&#12513;&#12540;&#12472;&#65292;&#22810;&#25968;&#12398;&#38914;&#28857;&#12434;&#25345;&#12388;&#35079;&#21512;&#12472;&#12458;&#12513;&#12488;&#12522;&#12392;&#12356;&#12387;&#12383;)&#36890;&#24120;&#12398;&#12487;&#12540;&#12479;&#12506;&#12540;&#12472;&#12395;&#36969;&#21512;&#12375;&#12394;&#12356;&#65292;(&#12487;&#12540;&#12479;&#12469;&#12452;&#12474;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;)&#24040;&#22823;&#12394;&#20516;&#12434;&#32013;&#12417;&#12427;&#12383;&#12417;&#12398;&#12300;&#25313;&#24373;&#37096;&#23627;&#12301;&#12398;&#19968;&#31278;&#12391;&#12377;&#65294;&#35443;&#32048;&#24773;&#22577;&#12399; http://www.postgresql.org/docs/8.0/static/storage-toast.html &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#65294;
	  
	  </p><p>
	  &#39640;&#35299;&#20687;&#24230;&#12391;&#20840;&#12390;&#12398;&#12520;&#12540;&#12525;&#12483;&#12497;&#12398;&#22269;&#12398;&#22659;&#30028;&#12434;&#21547;&#12416;&#12486;&#12540;&#12502;&#12523;&#12398;&#12424;&#12358;&#12394;)&#22823;&#12365;&#12394;&#12472;&#12458;&#12513;&#12488;&#12522;&#12364;&#12354;&#12427;&#12358;&#12360;&#65292;&#34892;&#12364;&#12381;&#12358;&#22810;&#12367;&#12394;&#12356;&#12486;&#12540;&#12502;&#12523;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#65292;&#12371;&#12398;&#21839;&#38988;&#12364;&#20986;&#12390;&#12365;&#12414;&#12377;&#65294;&#12486;&#12540;&#12502;&#12523;&#33258;&#20307;&#12399;&#23567;&#12373;&#12356;&#12398;&#12391;&#12377;&#12364;&#65292;&#22810;&#12367;&#12398;TOAST&#12473;&#12506;&#12540;&#12473;&#12434;&#20351;&#12356;&#12414;&#12377;&#65294;&#20363;&#12392;&#12375;&#12390;&#65292;&#12486;&#12540;&#12502;&#12523;&#33258;&#20307;&#12399;&#27010;&#12397;80&#34892;&#12391;3&#12487;&#12540;&#12479;&#12506;&#12540;&#12472;&#12375;&#12363;&#20351;&#12431;&#12394;&#12367;&#12390;&#12418;TOAST&#12486;&#12540;&#12502;&#12523;&#12391;8225&#12506;&#12540;&#12472;&#12434;&#20351;&#12358;&#12392;&#12375;&#12414;&#12377;&#65294;
	  
	  </p><p>
	  &#12371;&#12371;&#12391;&#65292;&#12472;&#12458;&#12513;&#12488;&#12522;&#28436;&#31639;&#23376;&#12398;&amp;&amp;&#12434;&#20351;&#12387;&#12390;&#65292;&#12411;&#12392;&#12435;&#12393;&#12510;&#12483;&#12481;&#12375;&#12394;&#12356;&#12424;&#12358;&#12394;&#12496;&#12454;&#12531;&#12480;&#12522;&#12508;&#12483;&#12463;&#12473;&#12434;&#26908;&#32034;&#12377;&#12427;&#12463;&#12456;&#12522;&#12434;&#20986;&#12375;&#12390;&#12415;&#12414;&#12377;&#65294;&#12463;&#12456;&#12522;&#12458;&#12503;&#12486;&#12451;&#12510;&#12452;&#12470;&#12395;&#12399;&#12486;&#12540;&#12502;&#12523;&#12399;3&#12506;&#12540;&#12472;80&#34892;&#12375;&#12363;&#12394;&#12356;&#12424;&#12358;&#12395;&#35211;&#12360;&#12414;&#12377;&#65294;&#12458;&#12503;&#12486;&#12451;&#12510;&#12452;&#12470;&#12399;&#65292;&#23567;&#12373;&#12394;&#12486;&#12540;&#12502;&#12523;&#12434;&#38918;&#12395;&#36208;&#26619;&#12377;&#12427;&#26041;&#12364;&#12452;&#12531;&#12487;&#12463;&#12473;&#12434;&#20351;&#12358;&#12424;&#12426;&#12418;&#26089;&#12356;&#12392;&#35211;&#31309;&#12418;&#12426;&#12414;&#12377;&#65294;&#12381;&#12375;&#12390;&#65292;GiST&#12452;&#12531;&#12487;&#12463;&#12473;&#12399;&#28961;&#35222;&#12377;&#12427;&#12392;&#27770;&#12417;&#12414;&#12377;&#65294;&#36890;&#24120;&#12394;&#12425;&#65292;&#12371;&#12398;&#35211;&#31309;&#12418;&#12426;&#12399;&#27491;&#12375;&#12356;&#12391;&#12377;&#65294;&#12375;&#12363;&#12375;&#65292;&#12371;&#12398;&#22580;&#21512;&#12399; &amp;&amp;&#28436;&#31639;&#23376;&#12364;&#20840;&#12390;&#12398;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#12487;&#12451;&#12473;&#12463;&#12363;&#12425;&#21628;&#12403;&#20986;&#12375;&#12391;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12392;&#27604;&#36611;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12426;&#65292;&#12422;&#12360;&#12395;&#65292;&#20840;&#12390;&#12398;TOAST&#12506;&#12540;&#12472;&#12418;&#12414;&#12383;&#21628;&#12403;&#20986;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65294;
	  
	  </p><p>
	  &#12371;&#12398;&#12496;&#12464;&#12395;&#33510;&#12375;&#12416;&#12363;&#12393;&#12358;&#12363;&#12434;&#35211;&#12427;&#12395;&#12399;&#65292;PostgreSQL&#12398;"EXPLAIN ANALYZE"&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#65294;&#35443;&#12375;&#12356;&#24773;&#22577;&#12392;&#25216;&#34899;&#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#65292;postgres performance mailing list &#12398;&#12473;&#12524;&#12483;&#12489; ( http://archives.postgresql.org/pgsql-performance/2005-02/msg00030.php ) &#12434;&#12372;&#35239;&#19979;&#12373;&#12356;&#65294;
	  
	  </p></div><div class="sect2" title="6.1.2. &#24540;&#24613;&#20966;&#32622;"><div class="titlepage"><div><div><h3 class="title"><a name="id286827108"></a>6.1.2. 
	  &#24540;&#24613;&#20966;&#32622;
	  
	  </h3></div></div></div><p>
	  PostgreSQL&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12391;&#12399;&#65292;TOAST&#12434;&#24847;&#35672;&#12375;&#12383;&#12463;&#12456;&#12522;&#35211;&#31309;&#12418;&#12426;&#12434;&#20316;&#12427;&#12371;&#12392;&#12391;&#65292;&#12371;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#65294;&#20170;&#12398;&#12392;&#12371;&#12429;&#12399;&#65292;&#20108;&#12388;&#12398;&#24540;&#24613;&#20966;&#32622;&#12364;&#12354;&#12426;&#12414;&#12377;&#65294;
	  
	  </p><p>
	  &#19968;&#12388;&#30446;&#12399;&#65292;&#12463;&#12456;&#12522;&#12503;&#12521;&#12531;&#12490;&#12395;&#12452;&#12531;&#12487;&#12463;&#12473;&#12398;&#20351;&#29992;&#12434;&#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#65294;&#12463;&#12456;&#12522;&#12434;&#30330;&#34892;&#12377;&#12427;&#21069;&#12395;"SET enable_seqscan TO off;"&#12434;&#12469;&#12540;&#12496;&#12395;&#36865;&#20449;&#12375;&#12414;&#12377;&#65294;&#12371;&#12428;&#12399;&#22522;&#26412;&#30340;&#12395;&#12463;&#12456;&#12522;&#12503;&#12521;&#12531;&#12490;&#12395;&#23550;&#12375;&#12390;&#21487;&#33021;&#12394;&#38480;&#12426;&#38918;&#12395;&#36208;&#26619;&#12377;&#12427;&#12371;&#12392;&#12434;&#36991;&#12369;&#12427;&#12424;&#12358;&#24375;&#21046;&#12375;&#12414;&#12377;&#65294;&#12381;&#12398;&#12383;&#12417;GiST&#12452;&#12531;&#12487;&#12463;&#12473;&#12434;&#36890;&#24120;&#20351;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65294;&#12375;&#12363;&#12375;&#65292;&#12371;&#12398;&#12501;&#12521;&#12464;&#12399;&#25509;&#32154;&#12377;&#12427;&#12383;&#12403;&#12395;&#35373;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#65292;&#20182;&#12398;&#12465;&#12540;&#12473;&#12395;&#12362;&#12356;&#12390;&#12399;&#12463;&#12456;&#12522;&#12503;&#12521;&#12531;&#12490;&#12395;&#35492;&#12387;&#12383;&#35211;&#31309;&#12418;&#12426;&#12434;&#12373;&#12379;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12398;&#12391;&#65292; "SET enable_seqscan TO on;"&#12434;&#12463;&#12456;&#12522;&#12398;&#24460;&#12395;&#36865;&#20449;&#12377;&#12409;&#12365;&#12391;&#12377;&#65294;
	  
	  </p><p>
	  &#20108;&#12388;&#30446;&#12399;&#65292;&#38918;&#12395;&#36208;&#26619;&#12377;&#12427;&#12371;&#12392;&#12434;&#12463;&#12456;&#12522;&#12503;&#12521;&#12531;&#12490;&#12364;&#32771;&#12360;&#12427;&#31243;&#24230;&#12395;&#26089;&#12367;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#65294;&#12371;&#12428;&#12399;&#65292;&#12496;&#12454;&#12531;&#12480;&#12522;&#12508;&#12483;&#12463;&#12473;&#12398;&#12300;&#12461;&#12515;&#12483;&#12471;&#12517;&#12301;&#12434;&#34892;&#12358;&#36861;&#21152;&#12459;&#12521;&#12512;&#12434;&#20316;&#25104;&#12375;&#65292;&#12371;&#12398;&#12459;&#12521;&#12512;&#12395;&#12510;&#12483;&#12481;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#36948;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65294;&#12371;&#12371;&#12391;&#12398;&#20363;&#12391;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65294;
	  
	  </p><pre class="programlisting">SELECT AddGeometryColumn('myschema','mytable','bbox','4326','GEOMETRY','2'); 
UPDATE mytable SET bbox = ST_Envelope(ST_Force_2d(the_geom));</pre><p>
	  &#12381;&#12375;&#12390;&#65292;&#27425;&#12398;&#12424;&#12358;&#12395;&#65292;&amp;&amp;&#28436;&#31639;&#23376;&#12434;geom_column&#12395;&#23550;&#12375;&#12390;&#34892;&#12387;&#12390;&#12356;&#12383;&#12418;&#12398;&#12434;bbox&#12395;&#22793;&#26356;&#12375;&#12414;&#12377;&#65294;
	  
	  </p><pre class="programlisting">SELECT geom_column 
FROM mytable 
WHERE bbox &amp;&amp; ST_SetSRID('BOX3D(0 0,1 1)'::box3d,4326);</pre><p>
	  &#12418;&#12385;&#12429;&#12435;&#65292;mytable&#12398;&#34892;&#12434;&#22793;&#26356;&#12414;&#12383;&#12399;&#36861;&#21152;&#12375;&#12383;&#12425;&#65292; bbox&#12434;&#12300;&#21516;&#26399;&#12301;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65294;&#26368;&#12418;&#12377;&#12387;&#12365;&#12426;&#12375;&#12383;&#26041;&#27861;&#12399;&#12488;&#12522;&#12460;&#12391;&#12377;&#65294;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;bbox&#12459;&#12521;&#12512;&#12398;&#29694;&#29366;&#12434;&#20445;&#25345;&#12377;&#12427;&#12363;&#65292;&#12486;&#12540;&#12502;&#12523;&#26356;&#26032;&#24460;&#12395;&#12356;&#12388;&#12418;UPDATE&#12463;&#12456;&#12522;&#12434;&#23455;&#34892;&#12377;&#12427;&#12363;&#12391;&#12418;&#23550;&#24540;&#12391;&#12365;&#12414;&#12377;&#65294;
	  
	  </p></div></div><div class="sect1" title="6.2. &#12472;&#12458;&#12513;&#12488;&#12522;&#12452;&#12531;&#12487;&#12463;&#12473;&#12391;CLUSTER&#12434;&#23455;&#34892;&#12377;&#12427;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="id286827563"></a>6.2. 
	&#12472;&#12458;&#12513;&#12488;&#12522;&#12452;&#12531;&#12487;&#12463;&#12473;&#12391;CLUSTER&#12434;&#23455;&#34892;&#12377;&#12427;
	
	</h2></div></div></div><p>
	&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12411;&#12392;&#12435;&#12393;&#12391;&#65292;&#12363;&#12388;&#12411;&#12392;&#12435;&#12393;&#12398;&#12463;&#12456;&#12522;&#12391;&#12402;&#12392;&#12388;&#12398;&#12452;&#12531;&#12487;&#12463;&#12473;&#12434;&#20351;&#12358;&#12424;&#12358;&#12394;&#12486;&#12540;&#12502;&#12523;&#12398;&#12383;&#12417;&#12395;&#65292; PostgreSQL&#12399;CLUSTER&#12467;&#12510;&#12531;&#12489;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#65294;&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#65292;&#20840;&#12390;&#12398;&#12487;&#12540;&#12479;&#34892;&#12434;&#65292;&#12452;&#12531;&#12487;&#12463;&#12473;&#22522;&#28310;&#12395;&#12354;&#12431;&#12379;&#12390;&#29289;&#29702;&#30340;&#12395;&#20877;&#25972;&#29702;&#12377;&#12427;&#12398;&#12391;&#65292;&#20108;&#12388;&#12398;&#24615;&#33021;&#12398;&#21033;&#28857;&#12434;&#29983;&#12415;&#12414;&#12377;&#65294;&#12402;&#12392;&#12388;&#12399;&#65292;&#12452;&#12531;&#12487;&#12463;&#12473;&#31684;&#22258;&#12398;&#36208;&#26619;&#12398;&#12383;&#12417;&#12395;&#65292;&#12487;&#12540;&#12479;&#12486;&#12540;&#12502;&#12523;&#12398;&#12471;&#12540;&#12463;&#22238;&#25968;&#12364;&#21127;&#30340;&#12395;&#28187;&#23569;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#65294;&#12405;&#12383;&#12388;&#12417;&#12399;&#65292;&#12356;&#12367;&#12388;&#12363;&#12398;&#23567;&#12373;&#12394;&#12452;&#12531;&#12487;&#12463;&#12473;&#38291;&#38548;&#12395;&#38598;&#20013;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#65292;&#12487;&#12540;&#12479;&#34892;&#12364;&#20998;&#24067;&#12377;&#12427;&#12487;&#12540;&#12479;&#12506;&#12540;&#12472;&#12364;&#12424;&#12426;&#23569;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391;&#65292;&#12424;&#12426;&#21177;&#29575;&#30340;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#25345;&#12388;&#12371;&#12392;&#12391;&#12377;&#65294; (&#12371;&#12398;&#28857;&#12391;&#65292;PostgreSQL&#12510;&#12491;&#12517;&#12450;&#12523;&#12398;CLUSTER&#12467;&#12510;&#12531;&#12489;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#35501;&#12416;&#12424;&#12358;&#12395;&#20181;&#21521;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12392;&#24863;&#12376;&#12390;&#19979;&#12373;&#12356;&#65294;)
	
	</p><p>
	&#12375;&#12363;&#12375;&#65292;GiST&#12452;&#12531;&#12487;&#12463;&#12473;&#12399;&#21336;&#32020;&#12395;NULL&#20516;&#12434;&#28961;&#35222;&#12377;&#12427;&#12383;&#12417;&#29694;&#22312;&#12398;&#12392;&#12371;&#12429;PostGIS&#12398;GiST&#12452;&#12531;&#12487;&#12463;&#12473;&#12398;&#12463;&#12521;&#12473;&#12479;&#12522;&#12531;&#12464;&#12399;&#12391;&#12365;&#12378;&#65292;&#27425;&#12398;&#12424;&#12358;&#12394;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#24471;&#12414;&#12377;&#65294;
	
	</p><pre class="programlisting">lwgeom=# CLUSTER my_geom_index ON my_table; 
ERROR: cannot cluster when index access method does not handle null values
(&#12456;&#12521;&#12540;: &#12452;&#12531;&#12487;&#12463;&#12473;&#12450;&#12463;&#12475;&#12473;&#12513;&#12477;&#12483;&#12489;&#12364;NULL&#20516;&#12434;&#25201;&#12431;&#12394;&#12356;&#22580;&#21512;&#12463;&#12521;&#12473;&#12479;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;)
HINT: You may be able to work around this by marking column "the_geom" NOT NULL.
(&#12498;&#12531;&#12488;: &#21015;"the_geom"&#12434;NOT NULL&#12392;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292;&#12371;&#12428;&#12434;&#22238;&#36991;&#12391;&#12365;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;)
</pre><p>
	&#12498;&#12531;&#12488;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12354;&#12427;&#36890;&#12426;&#65292;&#12486;&#12540;&#12502;&#12523;&#12395;"not null"&#21046;&#38480;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292;&#12371;&#12398;&#27424;&#38501;&#12395;&#12392;&#12426;&#12354;&#12360;&#12378;&#23550;&#24540;&#12391;&#12365;&#12414;&#12377;&#65294;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#65294;
	
	</p><pre class="programlisting">lwgeom=# ALTER TABLE my_table ALTER COLUMN the_geom SET not null; 
ALTER TABLE</pre><p>
	&#12418;&#12385;&#12429;&#12435;&#65292;&#12472;&#12458;&#12513;&#12488;&#12522;&#12459;&#12521;&#12512;&#12391;&#23455;&#38555;&#12395;NULL&#20516;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#65292;&#12371;&#12398;&#23550;&#24540;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#65294;&#12373;&#12425;&#12395;&#12399;&#65292;&#21046;&#38480;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#19978;&#12398;&#26041;&#27861;&#12434;&#20351;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#65292; "ALTER TABLE blubb ADD CHECK (geometry is not null);"&#12398;&#12424;&#12358;&#12394;CHECK&#21046;&#38480;&#12399;&#20351;&#12360;&#12414;&#12379;&#12435;&#65294;
	
	</p></div><div class="sect1" title="6.3. &#27425;&#20803;&#22793;&#25563;&#12398;&#22238;&#36991;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="id286827606"></a>6.3. 
	&#27425;&#20803;&#22793;&#25563;&#12398;&#22238;&#36991;
	
	</h2></div></div></div><p>
	&#12392;&#12365;&#12393;&#12365;&#65292;&#12486;&#12540;&#12502;&#12523;&#12391;3&#27425;&#20803;&#65292;4&#27425;&#20803;&#12398;&#12487;&#12540;&#12479;&#12434;&#25345;&#12388;&#12398;&#12395;&#65292;&#24120;&#12395;OpenGIS&#28310;&#25312;&#12398;asText()&#12414;&#12383;&#12399;asBinary()&#38306;&#25968;&#12434;&#20351;&#12387;&#12390;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390; 2&#27425;&#20803;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#20986;&#21147;&#12373;&#12379;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#36215;&#12365;&#12414;&#12377;&#65294;&#20869;&#37096;&#12391;force_2d()&#38306;&#25968;&#12434;&#21628;&#12435;&#12391;&#12356;&#12427;&#12383;&#12417;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12364;&#65292;&#12371;&#12428;&#12399;&#65292;&#22823;&#12365;&#12394;&#12472;&#12458;&#12513;&#12488;&#12522;&#12391;&#12399;&#37325;&#22823;&#12394;&#12458;&#12540;&#12496;&#12504;&#12483;&#12489;&#12434;&#35480;&#24341;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#65294;&#12371;&#12398;&#12458;&#12540;&#12496;&#12504;&#12483;&#12489;&#12434;&#22238;&#36991;&#12377;&#12427;&#12395;&#12399;&#65292;&#19968;&#24230;&#36861;&#21152;&#12373;&#12428;&#12383;&#27425;&#20803;&#12434;&#21069;&#12418;&#12387;&#12390;&#33853;&#12392;&#12375;&#65292;&#12363;&#12388;&#12371;&#12428;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#12398;&#12364;&#36969;&#24403;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#65294;
	
	</p><pre class="programlisting">UPDATE mytable SET the_geom = ST_Force_2d(the_geom); 
VACUUM FULL ANALYZE mytable;</pre><p>
	AddGeometryColumn() &#12434;&#20351;&#12387;&#12390;&#12472;&#12458;&#12513;&#12488;&#12522;&#12459;&#12521;&#12512;&#12434;&#36861;&#21152;&#12375;&#12383;&#22580;&#21512;&#65292;&#12472;&#12458;&#12513;&#12488;&#12522;&#12398;&#27425;&#20803;&#12395;&#38306;&#12377;&#12427;&#21046;&#38480;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65294;&#12371;&#12398;&#21046;&#38480;&#12434;&#36802;&#22238;&#12377;&#12427;&#12395;&#12399;&#65292;&#21046;&#38480;&#12398;&#21066;&#38500;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#65294; geometry_columns&#12486;&#12540;&#12502;&#12523;&#20869;&#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#26356;&#26032;&#12375;&#12390;&#65292;&#12381;&#12398;&#24460;&#12391;&#21046;&#38480;&#12434;&#20877;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12391;&#19979;&#12373;&#12356;&#65294;
	
	</p><p>
	&#22823;&#12365;&#12394;&#12486;&#12540;&#12502;&#12523;&#12398;&#22580;&#21512;&#65292; WHERE&#31680;&#65292;&#12362;&#12424;&#12403;&#12503;&#12521;&#12452;&#12510;&#12522;&#12461;&#12540;&#33509;&#12375;&#12367;&#12399;&#20182;&#12398;&#36969;&#20999;&#12394;&#22522;&#28310;&#12395;&#12424;&#12387;&#12390;&#12486;&#12540;&#12502;&#12523;&#12398;&#19968;&#37096;&#12408;&#12398;UPDATE&#12434;&#21046;&#38480;&#12373;&#12379;&#12390;&#65292;UPDATE&#12398;&#23455;&#34892;&#12398;&#38291;&#12395;&#21336;&#12395;"VACUUM;"&#12392;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292; UPDATE&#12434;&#12424;&#12426;&#23567;&#12373;&#12356;&#22602;&#12395;&#20998;&#21106;&#12377;&#12427;&#12398;&#12364;&#36066;&#12356;&#12420;&#12426;&#26041;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#65294;&#12371;&#12428;&#12395;&#12424;&#12426;&#65292;&#12486;&#12531;&#12509;&#12521;&#12522;&#12487;&#12451;&#12473;&#12463;&#12473;&#12506;&#12540;&#12473;&#12364;&#21127;&#30340;&#12395;&#28187;&#23569;&#12375;&#12414;&#12377;&#65294;&#12373;&#12425;&#12395;&#65292;&#27425;&#20803;&#28151;&#21512;&#12398;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#25345;&#12388;&#22580;&#21512;&#65292; "WHERE dimension(the_geom)&gt;2"&#12391;UPDATE&#12434;&#21046;&#38480;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292; 2&#27425;&#20803;&#12391;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12472;&#12458;&#12513;&#12488;&#12522;&#12398;&#20877;&#26360;&#12365;&#36796;&#12415;&#12434;&#12473;&#12461;&#12483;&#12503;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65294;
	
	</p></div><div class="sect1" title="6.4. &#12467;&#12531;&#12501;&#12451;&#12462;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12398;&#12481;&#12517;&#12540;&#12531;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="id286826987"></a>6.4. 
	&#12467;&#12531;&#12501;&#12451;&#12462;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12398;&#12481;&#12517;&#12540;&#12531;
	
	</h2></div></div></div><div class="toc"><dl><dt><span class="sect2"><a href="ch06.html#id286827010">6.4.1. 
		&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;
		
		</a></span></dt><dt><span class="sect2"><a href="ch06.html#id286827877">6.4.2. &#23455;&#34892;&#26178;</a></span></dt></dl></div><p>
	&#12371;&#12398;&#25216;&#27861;&#12399;&#65292;FOSS4G 2007&#12459;&#12531;&#12501;&#12449;&#12524;&#12531;&#12473;&#12391;&#12398;Kevin Neufeld&#12398;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#12300;PostGIS&#12497;&#12527;&#12540;&#12518;&#12540;&#12470;&#12398;&#12383;&#12417;&#12398;&#25216;&#27861;(Tips for the PostGIS Power User)&#12301;&#12363;&#12425;&#24471;&#12383;&#12418;&#12398;&#12391;&#12377;&#65294;
	PostGIS&#12398;&#20351;&#29992;(&#12383;&#12392;&#12360;&#12400;&#65292;&#12300;&#38745;&#30340;&#12487;&#12540;&#12479;&#12392;&#35079;&#38609;&#12394;&#35299;&#26512;&#12301;&#23550;&#12300;&#12424;&#12367;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12373;&#12428;&#12427;&#12487;&#12540;&#12479;&#12392;&#22810;&#25968;&#12398;&#12518;&#12540;&#12470;&#12301;&#12394;&#12393;)&#12395;&#20381;&#23384;&#12375;&#12390;&#65292;&#12371;&#12428;&#12425;&#12398;&#22793;&#26356;&#12395;&#12424;&#12387;&#12390;&#65292;&#12463;&#12456;&#12522;&#12364;&#12399;&#12387;&#12365;&#12426;&#36895;&#24230;&#21521;&#19978;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65294;
	
	</p><p>
	&#35443;&#32048;&#24773;&#22577;(&#12362;&#12424;&#12403;&#12424;&#12426;&#12424;&#12356;&#26360;&#24335;)&#12395;&#12388;&#12356;&#12390;&#12399;&#65292;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#12364;<a class="ulink" href="http://2007.foss4g.org/presentations/view.php?abstract_id=117" target="_top">http://2007.foss4g.org/presentations/view.php?abstract_id=117</a>&#12395;&#12354;&#12426;&#12414;&#12377;&#65294;
	
    </p><div class="sect2" title="6.4.1. &#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;"><div class="titlepage"><div><div><h3 class="title"><a name="id286827010"></a>6.4.1. 
		&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;
		
		</h3></div></div></div><p>
		&#12371;&#12428;&#12425;&#12398;&#35373;&#23450;&#12399;postgresql.conf&#20869;&#12395;&#12354;&#12426;&#12414;&#12377;&#65294;
		
        </p><p>
		          <a class="ulink" href="http://www.postgresql.org/docs/current/interactive/runtime-config-wal.html#GUC-CHECKPOINT-SEGMENTS" target="_top">checkpoint_segment_size</a> (&#12371;&#12398;&#35373;&#23450;&#12399;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;PostgreSQL&#12391;&#12399;&#38750;&#25512;&#22888;)&#12399;&#65292;checkpoint &#12420; WAL &#12391;&#12399;&#12376;&#12414;&#12427;&#22810;&#25968;&#12398;&#35373;&#23450;&#12395;&#20837;&#12428;&#26367;&#12360;&#12425;&#12428;&#12414;&#12375;&#12383;&#65294;
		
        </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
			WAL&#12501;&#12449;&#12452;&#12523;&#25968; = 16MB&#12372;&#12392;; &#12487;&#12501;&#12457;&#12523;&#12488;&#12399; 3
			
            </p></li><li class="listitem"><p>
			&#26360;&#12365;&#36796;&#12415;&#12364;&#22810;&#12356;&#31561;&#22823;&#12365;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#36000;&#33655;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#65292;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12372;&#12392;&#12395;&#23569;&#12394;&#12367;&#12392;&#12418;10&#12363;30&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#65294;&#20182;&#12398;&#35352;&#20107;&#12392;&#12375;&#12390;<a class="ulink" href="http://www.westnet.com/~gsmith/content/postgresql/chkp-bgw-83.htm" target="_top">Greg Smith: Checkpoint and Background writer</a>&#12364;&#12354;&#12426;&#12414;&#12377;&#65294;			
			
            </p></li><li class="listitem"><p>
			&#12362;&#12381;&#12425;&#12367;xlog&#12434;&#21029;&#12398;&#12487;&#12451;&#12473;&#12463;&#12487;&#12496;&#12452;&#12473;&#12395;&#26684;&#32013;&#12375;&#12390;&#19979;&#12373;&#12356;&#65294;
			
            </p></li></ul></div><p>
           <a class="ulink" href="http://www.postgresql.org/docs/current/interactive/runtime-config-query.html#GUC-CONSTRAINT-EXCLUSION" target="_top">constraint_exclusion</a>
        </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
			&#12487;&#12501;&#12457;&#12523;&#12488;: off (PostgreSQL 8.4&#12424;&#12426;&#21069;&#65292;8.4&#20197;&#19978;&#12399;partition&#12395;&#35373;&#23450;)
			
            </p></li><li class="listitem"><p>
			&#12371;&#12428;&#12399;&#19968;&#33324;&#30340;&#12395;&#12486;&#12540;&#12502;&#12523;&#12497;&#12540;&#12486;&#12451;&#12471;&#12519;&#12491;&#12531;&#12464;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#65294;PostgreSQL 8.4&#12424;&#12426;&#21069;&#12398;&#22580;&#21512;&#12399;&#65292;"on"&#12434;&#35373;&#32622;&#12375;&#12390;&#65292;&#12463;&#12456;&#12522;&#12503;&#12521;&#12531;&#12490;&#12395;&#23550;&#12375;&#12390;&#65292;&#27714;&#12417;&#12427;&#12424;&#12358;&#12394;&#26368;&#36969;&#21270;&#12434;&#12373;&#12379;&#12414;&#12377;&#65294;8.4&#12398;&#22580;&#21512;&#12399;"partition"&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#65294;&#32153;&#25215;&#12373;&#12428;&#12383;&#38542;&#23652;&#12398;&#20013;&#12395;&#12354;&#12426;&#65292;&#12503;&#12521;&#12531;&#12490;&#12395;&#20182;&#12398;&#12506;&#12490;&#12523;&#12486;&#12451;&#12434;&#19982;&#12360;&#12394;&#12356;&#22580;&#21512;&#12399;&#65292;&#12503;&#12521;&#12531;&#12490;&#12395;&#21046;&#38480;&#12434;&#32771;&#24942;&#12375;&#12383;&#12486;&#12540;&#12502;&#12523;&#35299;&#26512;&#12434;&#24375;&#21046;&#12375;&#12414;&#12377;&#65294;PostgreSQL 8.4&#20197;&#19978;&#12391;&#12399;&#65292;&#12371;&#12385;&#12425;&#12364;&#29702;&#24819;&#30340;&#12395;&#12394;&#12426;&#12414;&#12377;&#65294;
			
            </p></li></ul></div><p>
           <a class="ulink" href="http://www.postgresql.org/docs/current/interactive/runtime-config-resource.html" target="_top">shared_buffers</a>
        </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
			&#12487;&#12501;&#12457;&#12523;&#12488;: 32MB&#20197;&#19979;
			
            </p></li><li class="listitem"><p>
			&#20351;&#29992;&#21487;&#33021;&#12394;RAM&#12398;1/3&#12363;&#12425;3/4&#31243;&#24230;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#65294;
			
            </p></li></ul></div></div><div class="sect2" title="6.4.2. &#23455;&#34892;&#26178;"><div class="titlepage"><div><div><h3 class="title"><a name="id286827877"></a>6.4.2. &#23455;&#34892;&#26178;</h3></div></div></div><p>
		<a class="ulink" href="http://www.postgresql.org/docs/current/interactive/runtime-config-resource.html#GUC-WORK-MEM" target="_top">work_mem</a> (&#12477;&#12540;&#12488;&#20966;&#29702;&#12420;&#35079;&#38609;&#12394;&#12463;&#12456;&#12522;&#12395;&#20351;&#12431;&#12428;&#12427;&#12513;&#12514;&#12522;)

		
        </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
			&#12487;&#12501;&#12457;&#12523;&#12488;: 1MB
			
            </p></li><li class="listitem"><p>
			&#22823;&#12365;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#65292;&#35079;&#38609;&#12394;&#12463;&#12456;&#12522;&#65292;RAM&#12364;&#22810;&#12356;&#22580;&#21512;&#12395;&#12399;&#19978;&#12370;&#12414;&#12377;&#65294;
			
            </p></li><li class="listitem"><p>
			&#21516;&#26178;&#20351;&#29992;&#12364;&#22810;&#25968;&#65292;&#12414;&#12383;&#12399;RAM&#12364;&#23569;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#19979;&#12370;&#12414;&#12377;&#65294;
			
            </p></li><li class="listitem"><p>
			&#22810;&#25968;&#12398;RAM&#12434;&#25345;&#12385;&#65292;&#38283;&#30330;&#32773;&#12364;&#23569;&#25968;&#12394;&#12425;&#65292;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#65294;
                </p><pre class="programlisting">
                    SET work_mem TO 1200000;
                </pre><p>
			
            </p></li></ul></div><p>
          <a class="ulink" href="http://www.postgresql.org/docs/current/interactive/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM" target="_top">maintenance_work_mem</a> (VACUUM, CREATE INDEX &#31561;&#12391;&#20351;&#29992;)
          
        </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
			&#12487;&#12501;&#12457;&#12523;&#12488;: 16MB
			
            </p></li><li class="listitem"><p>
			&#36890;&#24120;&#12391;&#12399;&#20302;&#12377;&#12366;&#12414;&#12377; - &#12513;&#12514;&#12522;&#12398;&#12473;&#12527;&#12483;&#12503;&#12398;&#38291;&#65292;&#20837;&#20986;&#21147;&#12434;&#32283;&#12426;&#65292;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12483;&#12463;&#12375;&#12414;&#12377;&#65294;
			
            </p></li><li class="listitem"><p>
			32MB&#12363;&#12425;256MB&#12364;&#25512;&#22888;&#12391;&#12377;&#65294;
			&#25509;&#32154;&#12518;&#12540;&#12470;&#25968;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#65294;
			&#22810;&#25968;&#12398;RAM&#12434;&#25345;&#12385;&#38283;&#30330;&#32773;&#12364;&#23569;&#12394;&#12356;&#22580;&#21512;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#65294;
			
                </p><pre class="programlisting">
                    SET maintainence_work_mem TO 1200000;
                </pre><p>
            </p></li></ul></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch05.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="reference.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;5&#31456; 
  PostGIS&#12434;&#20351;&#12358;: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#27083;&#31689;&#12377;&#12427;
  
   </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#31532;7&#31456; 
  PostGIS&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;
  
  </td></tr></table></div></body></html>
