<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>PostGIS_DropBBox</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.1"><link rel="home" href="index.html" title="PostGIS 1.5.1 &#12510;&#12491;&#12517;&#12450;&#12523; &#26085;&#26412;&#35486;&#35379;"><link rel="up" href="reference.html#Exceptional_Functions" title="7.13. &#20363;&#22806;&#30340;&#38306;&#25968;"><link rel="prev" href="PostGIS_AddBBox.html" title="PostGIS_AddBBox"><link rel="next" href="PostGIS_HasBBox.html" title="PostGIS_HasBBox"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">PostGIS_DropBBox</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="PostGIS_AddBBox.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center">7.13. 
	&#20363;&#22806;&#30340;&#38306;&#25968;
	
	</th><td width="20%" align="right"> <a accesskey="n" href="PostGIS_HasBBox.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="refentry" title="PostGIS_DropBBox"><a name="PostGIS_DropBBox"></a><div class="titlepage"></div><div class="refnamediv"><h2>&#21517;&#21069;</h2><p>PostGIS_DropBBox &#8212; 
			&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#12472;&#12458;&#12513;&#12488;&#12522;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;&#65294;
			
			</p></div><div class="refsynopsisdiv" title="&#27010;&#35201;"><h2>&#27010;&#35201;</h2><div class="funcsynopsis"><p><code class="funcdef">geometry <b class="fsfunc">PostGIS_DropBBox</b>(</code>geometry  <var class="pdparam">geomA</var><code>)</code>;</p></div></div><div class="refsection" title="&#35500;&#26126;"><a name="id286914305"></a><h2>&#35500;&#26126;</h2><p>
			&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#12472;&#12458;&#12513;&#12488;&#12522;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;&#65294;
			&#12371;&#12428;&#12395;&#12424;&#12426;&#12472;&#12458;&#12513;&#12488;&#12522;&#12398;&#12469;&#12452;&#12474;&#12399;&#32302;&#23567;&#12375;&#12414;&#12377;&#12364;&#65292;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12505;&#12540;&#12473;&#12398;&#12463;&#12456;&#12522;&#12399;&#36933;&#12367;&#12394;&#12426;&#12414;&#12377;&#65294;&#19981;&#27491;&#12394;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12398;&#21066;&#38500;&#12395;&#12418;&#20351;&#12356;&#12414;&#12377;&#65294;&#19981;&#27491;&#12394;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12434;&#30693;&#12427;&#12383;&#12417;&#12398;&#12469;&#12452;&#12531;&#12399;&#65292;ST_Intersects&#12420;&#20182;&#12398;&#38306;&#36899;&#12463;&#12456;&#12522;&#12364;&#24403;&#28982;TRUE&#12395;&#12394;&#12427;&#12409;&#12365;&#12472;&#12458;&#12513;&#12488;&#12522;&#12434;&#28961;&#35222;&#12377;&#12427;&#26178;&#12391;&#12377;&#65294;
			
				</p><div class="note" title="&#27880;&#24847;" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Note"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td><th align="left"></th></tr><tr><td align="left" valign="top"><p>
			  &#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12395;&#12399;&#12472;&#12458;&#12513;&#12488;&#12522;&#12364;&#33258;&#21205;&#30340;&#12395;&#36861;&#21152;&#12373;&#12428;&#65292;
			  &#24517;&#35201;&#12364;&#28961;&#12367;&#12390;&#12418;&#12463;&#12456;&#12522;&#12398;&#36895;&#24230;&#12434;&#25913;&#21892;&#12373;&#12379;&#12414;&#12377;&#65294;
			  &#29983;&#25104;&#12373;&#12428;&#12383;&#12472;&#12458;&#12513;&#12488;&#12522;&#12508;&#12483;&#12463;&#12473;&#12364;&#20309;&#12425;&#12363;&#12398;&#26041;&#27861;&#12391;&#22730;&#12373;&#12428;&#12383;&#12426;&#65292;&#12496;&#12454;&#12531;&#12480;&#12522;&#12508;&#12483;&#12463;&#12473;&#12364;&#27424;&#12369;&#12390;&#12356;&#12427;&#21476;&#12356;&#29256;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#20351;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65294;&#12381;&#12398;&#38555;&#65292;&#21476;&#12356;&#12418;&#12398;&#12434;&#21066;&#38500;&#12375;&#12390;&#36861;&#21152;&#12375;&#12394;&#12362;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65294; &#12371;&#12398;&#31278;&#12398;&#30772;&#22730;&#12399;8.3-8.3.6&#12471;&#12522;&#12540;&#12474;&#12391;&#35211;&#12425;&#12428;&#12414;&#12377;&#65294;
&#12371;&#12428;&#12399;&#65292;&#12472;&#12458;&#12513;&#12488;&#12522;&#26356;&#26032;&#26178;&#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12364;&#24120;&#12395;&#12399;&#20877;&#35336;&#31639;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12420;&#65292;&#12480;&#12531;&#12503;&#12392;&#12522;&#12525;&#12540;&#12489;&#12434;&#20276;&#12431;&#12394;&#12356;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12391;&#30772;&#22730;&#12373;&#12428;&#12383;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12364;&#20462;&#27491;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12395;&#12424;&#12426;&#12414;&#12377;&#65294;&#27425;&#12434;&#20351;&#12387;&#12390;&#25163;&#21205;&#20462;&#27491;&#12392;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#36861;&#21152;&#12434;&#34892;&#12358;&#12363;&#65292;&#12480;&#12531;&#12503;&#12392;&#12522;&#12525;&#12540;&#12489;&#12434;&#34892;&#12356;&#12414;&#12377;&#65294;
			  
				</p></td></tr></table></div><p><span class="inlinemediaobject"><img src="images/check.png"></span>
 &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#26354;&#32218;&#12473;&#12488;&#12522;&#12531;&#12464;&#12392;&#26354;&#32218;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#65294;</p></div><div class="refsection" title="&#20363;"><a name="id286914336"></a><h2>&#20363;</h2><pre class="programlisting">
--&#12371;&#12398;&#20363;&#12391;&#12399;&#65292;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#19981;&#27491;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;
--&#12496;&#12454;&#12531;&#12480;&#12522;&#12508;&#12483;&#12463;&#12473;&#12434;&#21066;&#38500;&#12375;&#12390;&#12356;&#12414;&#12377;&#65294;
--Box2D&#12434;&#36969;&#29992;&#12377;&#12427;&#21069;&#12395;ST_AsBinary&#12434;&#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292;
--&#12508;&#12483;&#12463;&#12473;&#12434;&#24375;&#21046;&#30340;&#12395;&#20877;&#35336;&#31639;&#12375;&#12414;&#12377;&#65294;
--&#12486;&#12540;&#12502;&#12523;&#12472;&#12458;&#12513;&#12488;&#12522;&#12395;&#36969;&#29992;&#12373;&#12428;&#12383;Box2D&#12399;
--&#24120;&#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;&#12496;&#12454;&#12531;&#12487;&#12451;&#12531;&#12464;&#12508;&#12483;&#12463;&#12473;&#12434;&#36820;&#12375;&#12414;&#12377;&#65294;
This example drops bounding boxes where the cached box is not correct
			--The force to ST_AsBinary before applying Box2D forces a recalculation of the box, and Box2D applied to the table geometry always
			-- returns the cached bounding box.
			UPDATE sometable
 SET the_geom =  PostGIS_DropBBox(the_geom)
 WHERE Not (Box2D(ST_AsBinary(the_geom)) = Box2D(the_geom));

	UPDATE sometable
 SET the_geom =  PostGIS_AddBBox(the_geom)
 WHERE Not PostGIS_HasBBOX(the_geom);


 </pre></div><div class="refsection" title="&#38306;&#36899;&#24773;&#22577;"><a name="id286914352"></a><h2>&#38306;&#36899;&#24773;&#22577;</h2><p><a class="xref" href="PostGIS_AddBBox.html" title="PostGIS_AddBBox">PostGIS_AddBBox</a>, <a class="xref" href="PostGIS_HasBBox.html" title="PostGIS_HasBBox">PostGIS_HasBBox</a>, <a class="xref" href="Box2D.html" title="Box2D">Box2D</a></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="PostGIS_AddBBox.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"><a accesskey="u" href="reference.html#Exceptional_Functions">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="PostGIS_HasBBox.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">PostGIS_AddBBox </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> PostGIS_HasBBox</td></tr></table></div></body></html>
